<?php

	//字符串的拼接
	$s1 = 'Hello';
	$s2 = 'World!';
	echo $s1.$s2;
	echo '<hr/>';
	
	// 赋值运算
	$i = 3;
	$str = 'Hi!';
	//	"+="运算符的使用
	$i += 1;
	echo $i,'<hr/>';
	//	".="运算符的使用
	$str .= "kaka";
	echo $str,'<hr/>';
	
	//自增或自减运算符
	$a = 2;
	//先赋值后自增
	$b = $a++;
	echo 'a=',$a,'<br>','b=',$b;
	$d = 2;
	//自增后赋值
	$c =++$d;
	echo '<hr/>','d=',$d,'<br>','c=',$c,'<br>';
	
	//自减运算
	echo '<br>','自减运算','<hr/>';
	$i = 3;
	//自减后再赋值
	$j =--$i;
	echo 'i=',$i,'<br>','j=',$j;
	//先赋值后自减
	$m = 6;
	$n = $m--;
	echo '<hr>','m=',$m,'<br>','n=',$n;

	